In [2]:
import pandas as pd

In [4]:
df=pd.read_csv('world_population.csv')

In [5]:
df.head()

,Country/Other,Population (2020),Yearly Change,Net Change,Density (P/Km²),Land Area (Km²),Migrants (net),Fert. Rate,Med. Age,Urban Pop %,World Share
0,Afghanistan,38928346,2.33,886592,60,652860,-62920,4.6,18,25.0,0.50
1,Albania,2877797,-0.11,-3120,105,27400,-14000,1.6,36,63.0,0.04
2,Algeria,43851044,1.85,797990,18,2381740,-10000,3.1,29,73.0,0.56
3,Angola,32866272,3.27,1040977,26,1246700,6413,5.6,17,67.0,0.42
4,Antigua and Barbuda,97929,0.84,811,223,440,0,2.0,34,26.0,0.00

In [6]:
df.info(
)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 201 entries, 0 to 200
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Country/Other      201 non-null    object
 1   Population (2020)  201 non-null    int64
 2   Yearly Change      201 non-null    float64
 3   Net Change         201 non-null    int64
 4   Density (P/Km²)    201 non-null    int64
 5   Land Area (Km²)    201 non-null    int64
 6   Migrants (net)     201 non-null    int64
 7   Fert. Rate         201 non-null    float64
 8   Med. Age           201 non-null    int64
 9   Urban Pop %        194 non-null    float64
 10  World Share        201 non-null    float64
dtypes: float64(4), int64(6), object(1)
memory usage: 17.4+ KB

In [12]:
df.values

array([['Afghanistan', 38928346, 2.33, ..., 18, 25.0, 0.5],
       ['Albania', 2877797, -0.11, ..., 36, 63.0, 0.04],
       ['Algeria', 43851044, 1.85, ..., 29, 73.0, 0.56],
       ...,
       ['Yemen', 29825964, 2.28, ..., 20, 38.0, 0.38],
       ['Zambia', 18383955, 2.93, ..., 18, 45.0, 0.24],
       ['Zimbabwe', 14862924, 1.48, ..., 19, 38.0, 0.19]], dtype=object)

In [15]:
df.loc[0]

Country/Other        Afghanistan
Population (2020)       38928346
Yearly Change               2.33
Net Change                886592
Density (P/Km²)               60
Land Area (Km²)           652860
Migrants (net)            -62920
Fert. Rate                   4.6
Med. Age                      18
Urban Pop %                 25.0
World Share                  0.5
Name: 0, dtype: object

In [16]:
df.colums

AttributeError: 'DataFrame' object has no attribute 'colums'

In [17]:
df.set_index('Country/Other',inplace=True)

In [19]:
df.loc['Bulgaria']

Population (2020)    6948445.00
Yearly Change             -0.74
Net Change            -51674.00
Density (P/Km²)           64.00
Land Area (Km²)       108560.00
Migrants (net)         -4800.00
Fert. Rate                 1.60
Med. Age                  45.00
Urban Pop %               76.00
World Share                0.09
Name: Bulgaria, dtype: float64

In [21]:
df.iloc[0]

Population (2020)    38928346.00
Yearly Change               2.33
Net Change             886592.00
Density (P/Km²)            60.00
Land Area (Km²)        652860.00
Migrants (net)         -62920.00
Fert. Rate                  4.60
Med. Age                   18.00
Urban Pop %                25.00
World Share                 0.50
Name: Afghanistan, dtype: float64

In [22]:
df.columns

Index(['Population (2020)', 'Yearly Change', 'Net Change', 'Density (P/Km²)',
       'Land Area (Km²)', 'Migrants (net)', 'Fert. Rate', 'Med. Age',
       'Urban Pop %', 'World Share'],
      dtype='object')

In [52]:
bg=df.loc['Bulgaria']

In [80]:
name=pd.DataFrame(df,columns=['Population (2020)','Land Area (Km²)'])

In [81]:
name

                     Population (2020)  Land Area (Km²)
Country/Other
Afghanistan                   38928346           652860
Albania                        2877797            27400
Algeria                       43851044          2381740
Angola                        32866272          1246700
Antigua and Barbuda              97929              440
...                                ...              ...
Vietnam                       97338579           310070
Western Sahara                  597339           266000
Yemen                         29825964           527970
Zambia                        18383955           743390
Zimbabwe                      14862924           386850

[201 rows x 2 columns]

In [82]:
name.loc['Bulgaria']

Population (2020)    6948445
Land Area (Km²)       108560
Name: Bulgaria, dtype: int64

In [53]:
bg.to_csv('bg.csv')

In [67]:
name.to_csv('names.csv',sep=',',na_rep='')

In [68]:
pd.read_csv('names.csv')

           Country/Other  Population (2020)  Land Area (Km²)
0            Afghanistan           38928346           652860
1                Albania            2877797            27400
2                Algeria           43851044          2381740
3                 Angola           32866272          1246700
4    Antigua and Barbuda              97929              440
..                   ...                ...              ...
196              Vietnam           97338579           310070
197       Western Sahara             597339           266000
198                Yemen           29825964           527970
199               Zambia           18383955           743390
200             Zimbabwe           14862924           386850

[201 rows x 3 columns]

In [77]:
# name['Land Area (Km²)']='Land'

In [83]:
name

                     Population (2020)  Land Area (Km²)
Country/Other
Afghanistan                   38928346           652860
Albania                        2877797            27400
Algeria                       43851044          2381740
Angola                        32866272          1246700
Antigua and Barbuda              97929              440
...                                ...              ...
Vietnam                       97338579           310070
Western Sahara                  597339           266000
Yemen                         29825964           527970
Zambia                        18383955           743390
Zimbabwe                      14862924           386850

[201 rows x 2 columns]

In [110]:
Land Area short_name=name.rename(columns=({"(Km²)":'Area',"Population (2020)":'People'}))
short_name.to_csv('names.csv',sep=',',na_rep='')

In [112]:
rslt_df = short_name.loc[name['Population (2020)']<7000000]

In [108]:
rslt_df

                      People    Area
Country/Other
Albania              2877797   27400
Antigua and Barbuda    97929     440
Armenia              2963243   28470
Aruba                 106766     180
Bahamas               393244   10010
...                      ...     ...
Turkmenistan         6031200  469930
U.S. Virgin Islands   104425     350
Uruguay              3473730  175020
Vanuatu               307145   12190
Western Sahara        597339  266000

[95 rows x 2 columns]

In [113]:
my=pd.read_csv('names.csv')

In [114]:
my

           Country/Other    People     Area
0            Afghanistan  38928346   652860
1                Albania   2877797    27400
2                Algeria  43851044  2381740
3                 Angola  32866272  1246700
4    Antigua and Barbuda     97929      440
..                   ...       ...      ...
196              Vietnam  97338579   310070
197       Western Sahara    597339   266000
198                Yemen  29825964   527970
199               Zambia  18383955   743390
200             Zimbabwe  14862924   386850

[201 rows x 3 columns]

In [117]:
my['People']<20000

0      False
1      False
2      False
3      False
4      False
       ...
196    False
197    False
198    False
199    False
200    False
Name: People, Length: 201, dtype: bool

In [119]:
my.index

RangeIndex(start=0, stop=201, step=1)

In [120]:
my.shape

(201, 3)

In [121]:
my.mode()

           Country/Other      People   Area
0            Afghanistan       97929  700.0
1                Albania       98347    NaN
2                Algeria      104425    NaN
3                 Angola      105695    NaN
4    Antigua and Barbuda      106766    NaN
..                   ...         ...    ...
196              Vietnam   220892340    NaN
197       Western Sahara   273523615    NaN
198                Yemen   331002651    NaN
199               Zambia  1380004385    NaN
200             Zimbabwe  1439323776    NaN

[201 rows x 3 columns]

In [122]:
my.mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of            Country/Other    People     Area
0            Afghanistan  38928346   652860
1                Albania   2877797    27400
2                Algeria  43851044  2381740
3                 Angola  32866272  1246700
4    Antigua and Barbuda     97929      440
..                   ...       ...      ...
196              Vietnam  97338579   310070
197       Western Sahara    597339   266000
198                Yemen  29825964   527970
199               Zambia  18383955   743390
200             Zimbabwe  14862924   386850

[201 rows x 3 columns]>

In [123]:
my.sum()

Country/Other    AfghanistanAlbaniaAlgeriaAngolaAntigua and Bar...
People                                                  7794099349
Area                                                     129663150
dtype: object

In [124]:
my.mean()

C:\Users\Owner\AppData\Local\Temp\ipykernel_8092\1832953006.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  my.mean()

People    3.877661e+07
Area      6.450903e+05
dtype: float64

In [127]:
mmm=my['People'].mean()

In [129]:
my["People"]>=mmm

0       True
1      False
2       True
3      False
4      False
       ...
196     True
197    False
198    False
199    False
200    False
Name: People, Length: 201, dtype: bool